HeleShaw3/system/parameters

//Velocity
inletVelocity (0.02 0 0);

//transport values 
nu 0.00001789;

