HeleShaw3/system/parametersMesh
//Geometry3
xDir   0.1;
yDir   0.02;
zDir   5.5e-5;


//Mesh 
xMesh  10;
yMesh  2;
zMesh  1;
